<script setup>
document.title = 'PartyGDK - Политика конфиденциальности'
</script>

<template>
  <div class="container">
    <h1>Политика конфиденциальности</h1>
    <p class="text-muted">Последнее обновление: 27.05.2026</p>
    <hr>

    <h2>Какие данные сохраняются?</h2>
    <ul>
      <li>IP-адреса;</li>
      <li>Файлы cookie.</li>
    </ul>

    <h2>Для каких целей сохраняются эти данные?</h2>
    <ul>
      <li>Для ограничения числа запросов, которые можно отправить за определённый промежуток времени;</li>
      <li>Для восстановления данных о Пользователе: имени, кода комнаты, идентификатора;</li>
      <li>Для выполнения модерации игр.</li>
    </ul>

    <h2>Сроки хранения данных</h2>
    <p>Все данные, кроме файлов cookie, <strong>не записываются</strong> в базу данных и удаляются автоматически по истечении определённого времени.</p>
    <p>Файлы cookie сохраняются на устройстве Пользователя и могут быть удалены в любое время по желанию Пользователя.</p>
    <p>Срок хранения данных на сервере составляет <strong>от 10 (десяти) секунд до 2 (двух) часов</strong>, в зависимости от вида данных.</p>

    <h2>Изменение Политики конфиденциальности</h2>
    <p>Администрация Сайта оставляет за собой право вносить изменения в настоящую Политику конфиденциальности в любое время и обязуется уведомлять Пользователя о внесённых в Политику изменениях на главной странице Сайта.</p>
  </div>
</template>